app/Helpers/format_helper.php

    function brand_setting(string $key, $default = null)
    {
        static $cache = null;
        if ($cache === null) {
            $cache = [];
            try {
                $db = \Config\Database::connect();
                $rows = $db->table('app_settings')->get()->getResultArray();
---
SELECT *
FROM `app_settings`