app/Controllers/Home.php

    public function index(): string
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();
        $blogModel     = new BlogModel();
        $wModel        = new WishlistModel();

        $sid = session()->get('__cart_sid') ?? '';
        $uid = auth()->loggedIn() ? (int)auth()->user()->id : null;

        $db              = \Config\Database::connect();
        $banners         = $db->table('homepage_banners')->where('is_active', 1)->orderBy('sort_order', 'ASC')->get()->getResultArray();
        $newArrivals     = $productModel->listPublic(['flag' => 'new_arrival'], 8, 0);
        $bestSellers     = $productModel->listPublic(['flag' => 'best_seller'], 8, 0);
        $featuredCategories = $categoryModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->limit(8)->findAll();
        $foundersPick    = $productModel->listPublic(['flag' => 'featured'], 4, 0);
        $recentPosts     = $blogModel->getPublished(3);
        $pressMentions   = $db->table('press_mentions')->where('is_active', 1)->orderBy('sort_order', 'ASC')->get()->getResultArray();
        $wishlistedIds   = $wModel->getProductIds($sid, $uid);

        // Bar essentials collections with 4 preview images each
        $barCollections = [];
        foreach (['Whiskey Essentials' => 'whi-glasses', 'Cocktail Essentials' => 'cocktail-glass', 'Wine Essentials' => 'wine-glasses', 'Bar Accessories' => 'bar-accessories'] as $name => $slug) {
            $cat = $categoryModel->where('slug', $slug)->where('is_active', 1)->first();
---
SELECT *
FROM `homepage_banners`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
 LIMIT 8
SELECT *
FROM `press_mentions`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
SELECT *
FROM `categories`
WHERE `slug` = 'whi-glasses'
AND `is_active` = 1
 LIMIT 1