app/Controllers/Shop.php

    public function index(): string
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        $filters = $this->buildFilters();
        $page    = max(1, (int)$this->request->getGet('page'));
        $perPage = 24;
        $offset  = ($page - 1) * $perPage;

        $products   = $productModel->listPublic($filters, $perPage, $offset);
        $total      = $productModel->countPublic($filters);
        $categories = $categoryModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC

    public function newArrivals(): string
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        $filters = array_merge($this->buildFilters(), ['flag' => 'new_arrival']);
        $page    = max(1, (int)$this->request->getGet('page'));
        $perPage = 24;

        $products   = $productModel->listPublic($filters, $perPage, ($page - 1) * $perPage);
        $total      = $productModel->countPublic($filters);
        $categories = $categoryModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC

    public function bestSellers(): string
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        $filters = array_merge($this->buildFilters(), ['flag' => 'best_seller']);
        $page    = max(1, (int)$this->request->getGet('page'));
        $perPage = 24;

        $products   = $productModel->listPublic($filters, $perPage, ($page - 1) * $perPage);
        $total      = $productModel->countPublic($filters);
        $categories = $categoryModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC

    public function sale(): string
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        $filters = array_merge($this->buildFilters(), ['on_sale' => true]);
        $page    = max(1, (int)$this->request->getGet('page'));
        $perPage = 24;

        $products   = $productModel->listPublic($filters, $perPage, ($page - 1) * $perPage);
        $total      = $productModel->countPublic($filters);
        $categories = $categoryModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC

    public function product(string $handle): string
    {
        $productModel = new ProductModel();
        $mediaModel   = new ProductMediaModel();

        $product = is_numeric($handle)
            ? $productModel->getWithCategory((int)$handle)
            : $productModel->getByHandle($handle);

        if (!$product) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $media    = $mediaModel->where('product_id', $product['id'])->orderBy('sort_order', 'ASC')->findAll();
        $dbConn   = \Config\Database::connect();
        $variants = $dbConn->table('product_variants')
            ->where('product_id', $product['id'])->where('is_active', 1)
            ->orderBy('option_name', 'ASC')->orderBy('sort_order', 'ASC')
            ->get()->getResultArray();

        // Group variants by option_name
        $variantGroups = [];
        foreach ($variants as $v) {
            $variantGroups[$v['option_name']][] = $v;
        }

        $reviewModel = new \App\Models\ReviewModel();
        $reviews     = $reviewModel->getApproved($product['id']);
        $ratingStats = $reviewModel->getRatingStats($product['id']);

        $promoCodes = $dbConn->table('promo_codes')->where('is_active', 1)->orderBy('sort_order', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `product_media`
WHERE `product_id` = '1'
ORDER BY `sort_order` ASC
SELECT *
FROM `product_variants`
WHERE `product_id` = '1'
AND `is_active` = 1
ORDER BY `option_name` ASC, `sort_order` ASC
SELECT *
FROM `promo_codes`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC