app/Models/CartModel.php

    public function countItems(string $sessionId, ?int $userId = null): int
    {
        $builder = $this->db->table('cart_sessions');
        if ($userId) {
            $builder->groupStart()
                ->where('session_id', $sessionId)
                ->orWhere('user_id', $userId)
                ->groupEnd();
        } else {
            $builder->where('session_id', $sessionId);
        }
        return (int)$builder->selectSum('quantity')->get()->getRow()->quantity;
---
SELECT SUM(`quantity`) AS `quantity`
FROM `cart_sessions`
WHERE `session_id` = ''