app/Models/WishlistModel.php

SELECT COUNT(*) AS `numrows`
FROM `wishlists`
WHERE `product_id` = 1
AND `session_id` = ''
---
    public function isWishlisted(int $productId, string $sessionId, ?int $userId = null): bool
    {
        $builder = $this->where('product_id', $productId);
        if ($userId) {
            $builder->groupStart()->where('user_id', $userId)->orWhere('session_id', $sessionId)->groupEnd();
        } else {
            $builder->where('session_id', $sessionId);
        }
        return $builder->countAllResults() > 0;

SELECT `product_id`
FROM `wishlists`
WHERE `session_id` = ''
---
    public function getProductIds(string $sessionId, ?int $userId = null): array
    {
        $builder = $this->db->table('wishlists');
        if ($userId) {
            $builder->groupStart()->where('user_id', $userId)->orWhere('session_id', $sessionId)->groupEnd();
        } else {
            $builder->where('session_id', $sessionId);
        }
        return array_column($builder->select('product_id')->get()->getResultArray(), 'product_id');